# Subqueries in the SELECT, FROM, WHERE statements#

In [7]:
import pandas as pd
import sqlite3

<img src="chinook.png">

In [8]:
# connect withe the chinook database 
connection = sqlite3.connect("chinook.db")

# cursor object 
crsr = connection.cursor()

In [9]:
def sql_query(query):

    # execute the command to fetch all the data from the table emp 
    crsr.execute(query)

    # store all the fetched data in the ans variable 
    ans = crsr.fetchall()

    # get the column names in a table
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [102]:
#Subquery in FROM
query = '''
SELECT *
FROM genres
WHERE name LIKE 'r%';
'''

sql_query(query)

   GenreId           Name
0        1           Rock
1        5  Rock And Roll
2        8         Reggae
3       14       R&B/Soul

In [23]:
#Subquery in FROM
query = '''
SELECT thisisaname.*
FROM ( 
    SELECT *
    FROM genres
    WHERE name LIKE 'r%'
    ) thisisaname
WHERE thisisaname.genreid > 6;
'''

sql_query(query)

   GenreId      Name
0        8    Reggae
1       14  R&B/Soul

In [100]:
#Subquery in SELECT
query = '''
SELECT COUNT(*)
FROM tracks
'''

sql_query(query)

   COUNT(*)
0      3503

In [99]:
#Subquery in SELECT
query = '''
SELECT composer, COUNT(*) AS IndividualCount, 
                COUNT(*)*1.0/(SELECT COUNT(*)
                                FROM tracks) AS CountToTotalRatio
FROM tracks
WHERE composer <> 'none'
GROUP BY composer
HAVING IndividualCount > 30
'''

sql_query(query)

          Composer  IndividualCount  CountToTotalRatio
0     Billy Corgan               31           0.008850
1  Jagger/Richards               35           0.009991
2     Steve Harris               80           0.022838
3               U2               44           0.012561

In [114]:
#Subquery in WHERE
query = '''
SELECT hiredate
FROM employees
ORDER BY hiredate
LIMIT 5;
'''

sql_query(query)

              HireDate
0  2002-04-01 00:00:00
1  2002-05-01 00:00:00
2  2002-08-14 00:00:00
3  2003-05-03 00:00:00
4  2003-10-17 00:00:00

In [111]:
#Subquery in WHERE
query = '''
SELECT *
FROM employees
WHERE hiredate IN (SELECT hiredate
                    FROM employees
                    ORDER BY hiredate
                    LIMIT 5
                    );
'''

sql_query(query)

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com
5,6,Mitchell,Michael,IT Manager,1.0,1973-07-01 00:00:00,2003-10-17 00:00:00,5827 Bowness Road NW,Calgary,AB,Canada,T3B 0C5,+1 (403) 246-9887,+1 (403) 246-9899,michael@chinookcorp.com